Revit 2026 API

# ConnectorAssignedPressureDrop Property

---

The assigned pressure drop of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AssignedPressureDrop { get; set; }
```
```vb
Public Property AssignedPressureDrop As Double
	Get
	Set
```
```cpp
public:
property double AssignedPressureDrop {
	double get ();
	void set (double value);
}
```
```fsharp
member AssignedPressureDrop : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector is not in a family instance. Thrown when the connector's domain is not DomainHvac or DomainPiping. |
| ArgumentException | Thrown when set an invalid value. |
| InvalidOperationException | Thrown on failure to get or set assigned pressure drop. |

Assigned pressure drop may be assigned for connectors of some family instances. In order to set this property, it must be mapped to a writable instance parameter in the family definition.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace